; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=372, out_folder=./training, instance_id=84, seed=2108, goal_proportion=0.03

(define (problem blocksworld-84)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 - object)
 (:init 
    (arm-empty)
    (clear b249)
    (on b249 b311)
    (on-table b311)
    (clear b209)
    (on b209 b112)
    (on-table b112)
    (clear b5)
    (on-table b5)
    (clear b160)
    (on b160 b244)
    (on b244 b285)
    (on-table b285)
    (clear b188)
    (on b188 b369)
    (on b369 b99)
    (on b99 b339)
    (on-table b339)
    (clear b82)
    (on-table b82)
    (clear b342)
    (on-table b342)
    (clear b277)
    (on b277 b270)
    (on b270 b278)
    (on b278 b347)
    (on b347 b117)
    (on-table b117)
    (clear b163)
    (on b163 b255)
    (on b255 b89)
    (on-table b89)
    (clear b55)
    (on b55 b261)
    (on b261 b334)
    (on b334 b330)
    (on-table b330)
    (clear b57)
    (on b57 b20)
    (on-table b20)
    (clear b257)
    (on-table b257)
    (clear b218)
    (on-table b218)
    (clear b215)
    (on b215 b45)
    (on-table b45)
    (clear b155)
    (on-table b155)
    (clear b275)
    (on b275 b153)
    (on b153 b240)
    (on-table b240)
    (clear b190)
    (on-table b190)
    (clear b103)
    (on b103 b66)
    (on b66 b231)
    (on-table b231)
    (clear b201)
    (on b201 b293)
    (on b293 b132)
    (on b132 b343)
    (on b343 b13)
    (on-table b13)
    (clear b328)
    (on b328 b272)
    (on b272 b26)
    (on-table b26)
    (clear b223)
    (on b223 b371)
    (on-table b371)
    (clear b123)
    (on-table b123)
    (clear b151)
    (on b151 b87)
    (on b87 b286)
    (on-table b286)
    (clear b80)
    (on b80 b348)
    (on b348 b169)
    (on b169 b360)
    (on b360 b349)
    (on b349 b184)
    (on b184 b315)
    (on b315 b321)
    (on b321 b51)
    (on-table b51)
    (clear b187)
    (on b187 b104)
    (on-table b104)
    (clear b327)
    (on b327 b24)
    (on b24 b154)
    (on b154 b306)
    (on b306 b250)
    (on b250 b156)
    (on b156 b206)
    (on-table b206)
    (clear b106)
    (on b106 b225)
    (on-table b225)
    (clear b71)
    (on b71 b179)
    (on b179 b237)
    (on b237 b19)
    (on b19 b253)
    (on b253 b294)
    (on-table b294)
    (clear b191)
    (on b191 b284)
    (on-table b284)
    (clear b168)
    (on b168 b302)
    (on b302 b172)
    (on b172 b36)
    (on b36 b176)
    (on b176 b202)
    (on b202 b268)
    (on b268 b346)
    (on b346 b34)
    (on-table b34)
    (clear b263)
    (on-table b263)
    (clear b256)
    (on-table b256)
    (clear b73)
    (on-table b73)
    (clear b143)
    (on-table b143)
    (clear b10)
    (on b10 b363)
    (on-table b363)
    (clear b110)
    (on-table b110)
    (clear b299)
    (on-table b299)
    (clear b280)
    (on b280 b344)
    (on b344 b25)
    (on-table b25)
    (clear b88)
    (on b88 b258)
    (on b258 b149)
    (on b149 b357)
    (on b357 b17)
    (on b17 b305)
    (on-table b305)
    (clear b111)
    (on b111 b230)
    (on b230 b50)
    (on-table b50)
    (clear b144)
    (on b144 b314)
    (on b314 b197)
    (on b197 b166)
    (on-table b166)
    (clear b273)
    (on b273 b109)
    (on b109 b333)
    (on b333 b325)
    (on b325 b271)
    (on b271 b324)
    (on b324 b23)
    (on-table b23)
    (clear b32)
    (on-table b32)
    (clear b235)
    (on b235 b290)
    (on b290 b326)
    (on-table b326)
    (clear b92)
    (on b92 b141)
    (on b141 b304)
    (on b304 b159)
    (on-table b159)
    (clear b1)
    (on b1 b85)
    (on b85 b251)
    (on-table b251)
    (clear b147)
    (on b147 b4)
    (on-table b4)
    (clear b224)
    (on b224 b351)
    (on b351 b292)
    (on b292 b210)
    (on-table b210)
    (clear b245)
    (on b245 b372)
    (on-table b372)
    (clear b170)
    (on b170 b310)
    (on b310 b269)
    (on b269 b142)
    (on b142 b367)
    (on b367 b118)
    (on b118 b61)
    (on b61 b291)
    (on b291 b358)
    (on-table b358)
    (clear b317)
    (on-table b317)
    (clear b140)
    (on-table b140)
    (clear b152)
    (on b152 b177)
    (on b177 b239)
    (on b239 b86)
    (on b86 b56)
    (on b56 b233)
    (on b233 b102)
    (on-table b102)
    (clear b289)
    (on-table b289)
    (clear b63)
    (on b63 b241)
    (on b241 b307)
    (on b307 b234)
    (on b234 b128)
    (on-table b128)
    (clear b303)
    (on b303 b364)
    (on b364 b232)
    (on b232 b316)
    (on b316 b120)
    (on b120 b52)
    (on b52 b95)
    (on b95 b354)
    (on-table b354)
    (clear b171)
    (on b171 b96)
    (on-table b96)
    (clear b164)
    (on b164 b44)
    (on b44 b49)
    (on b49 b236)
    (on b236 b228)
    (on-table b228)
    (clear b131)
    (on b131 b262)
    (on b262 b194)
    (on b194 b62)
    (on b62 b319)
    (on b319 b78)
    (on b78 b16)
    (on b16 b175)
    (on-table b175)
    (clear b217)
    (on-table b217)
    (clear b276)
    (on-table b276)
    (clear b136)
    (on-table b136)
    (clear b53)
    (on b53 b259)
    (on b259 b243)
    (on-table b243)
    (clear b186)
    (on b186 b246)
    (on b246 b195)
    (on b195 b6)
    (on-table b6)
    (clear b287)
    (on-table b287)
    (clear b93)
    (on b93 b59)
    (on-table b59)
    (clear b337)
    (on b337 b65)
    (on b65 b139)
    (on-table b139)
    (clear b264)
    (on b264 b54)
    (on b54 b98)
    (on b98 b47)
    (on-table b47)
    (clear b266)
    (on b266 b79)
    (on b79 b9)
    (on b9 b81)
    (on b81 b2)
    (on-table b2)
    (clear b7)
    (on b7 b301)
    (on-table b301)
    (clear b300)
    (on-table b300)
    (clear b145)
    (on-table b145)
    (clear b58)
    (on-table b58)
    (clear b193)
    (on b193 b77)
    (on-table b77)
    (clear b105)
    (on b105 b28)
    (on b28 b331)
    (on b331 b97)
    (on b97 b35)
    (on b35 b75)
    (on-table b75)
    (clear b359)
    (on b359 b157)
    (on-table b157)
    (clear b362)
    (on b362 b282)
    (on-table b282)
    (clear b3)
    (on-table b3)
    (clear b204)
    (on b204 b8)
    (on b8 b37)
    (on-table b37)
    (clear b254)
    (on b254 b38)
    (on-table b38)
    (clear b125)
    (on b125 b162)
    (on-table b162)
    (clear b281)
    (on-table b281)
    (clear b340)
    (on b340 b178)
    (on b178 b174)
    (on-table b174)
    (clear b115)
    (on-table b115)
    (clear b205)
    (on-table b205)
    (clear b165)
    (on b165 b283)
    (on b283 b21)
    (on b21 b370)
    (on-table b370)
    (clear b108)
    (on b108 b198)
    (on b198 b260)
    (on b260 b91)
    (on b91 b69)
    (on-table b69)
    (clear b267)
    (on-table b267)
    (clear b167)
    (on b167 b353)
    (on-table b353)
    (clear b122)
    (on-table b122)
    (clear b126)
    (on-table b126)
    (clear b356)
    (on b356 b309)
    (on b309 b322)
    (on-table b322)
    (clear b182)
    (on b182 b295)
    (on b295 b312)
    (on-table b312)
    (clear b100)
    (on b100 b27)
    (on b27 b222)
    (on b222 b173)
    (on-table b173)
    (clear b158)
    (on-table b158)
    (clear b208)
    (on-table b208)
    (clear b22)
    (on-table b22)
    (clear b336)
    (on b336 b124)
    (on b124 b116)
    (on b116 b199)
    (on b199 b148)
    (on b148 b350)
    (on b350 b297)
    (on-table b297)
    (clear b318)
    (on b318 b212)
    (on b212 b265)
    (on-table b265)
    (clear b127)
    (on b127 b207)
    (on-table b207)
    (clear b213)
    (on b213 b274)
    (on b274 b185)
    (on b185 b113)
    (on b113 b74)
    (on b74 b42)
    (on-table b42)
    (clear b135)
    (on b135 b296)
    (on-table b296)
    (clear b94)
    (on b94 b14)
    (on b14 b83)
    (on-table b83)
    (clear b133)
    (on b133 b192)
    (on b192 b161)
    (on b161 b33)
    (on b33 b332)
    (on b332 b211)
    (on-table b211)
    (clear b138)
    (on b138 b150)
    (on b150 b252)
    (on b252 b76)
    (on-table b76)
    (clear b329)
    (on-table b329)
    (clear b180)
    (on b180 b18)
    (on-table b18)
    (clear b368)
    (on-table b368)
    (clear b313)
    (on b313 b12)
    (on b12 b323)
    (on b323 b320)
    (on b320 b15)
    (on-table b15)
    (clear b183)
    (on b183 b220)
    (on b220 b238)
    (on b238 b121)
    (on b121 b72)
    (on b72 b365)
    (on-table b365)
    (clear b30)
    (on-table b30)
    (clear b352)
    (on-table b352)
    (clear b41)
    (on b41 b221)
    (on b221 b129)
    (on b129 b84)
    (on b84 b11)
    (on b11 b200)
    (on b200 b226)
    (on b226 b48)
    (on b48 b247)
    (on b247 b338)
    (on b338 b39)
    (on b39 b227)
    (on b227 b248)
    (on b248 b64)
    (on b64 b67)
    (on-table b67)
    (clear b219)
    (on b219 b242)
    (on-table b242)
    (clear b366)
    (on b366 b355)
    (on b355 b40)
    (on b40 b288)
    (on-table b288)
    (clear b308)
    (on b308 b279)
    (on b279 b46)
    (on b46 b361)
    (on b361 b60)
    (on b60 b345)
    (on b345 b29)
    (on-table b29)
    (clear b107)
    (on b107 b114)
    (on-table b114)
    (clear b196)
    (on b196 b31)
    (on-table b31)
    (clear b43)
    (on b43 b214)
    (on b214 b335)
    (on b335 b341)
    (on-table b341)
    (clear b70)
    (on-table b70)
    (clear b134)
    (on b134 b229)
    (on b229 b203)
    (on b203 b189)
    (on-table b189)
    (clear b101)
    (on b101 b298)
    (on b298 b216)
    (on-table b216)
    (clear b146)
    (on-table b146)
    (clear b137)
    (on-table b137)
    (clear b119)
    (on b119 b68)
    (on b68 b181)
    (on b181 b90)
    (on-table b90)
    (clear b130)
    (on-table b130))
 (:goal  (and 
    (clear b11)
    (on-table b11)
    (clear b2)
    (on b2 b6)
    (on-table b6)
    (clear b9)
    (on b9 b4)
    (on b4 b3)
    (on b3 b1)
    (on b1 b10)
    (on-table b10)
    (clear b7)
    (on b7 b8)
    (on b8 b5)
    (on-table b5))))

; plan
1. (unstack b10 b363)
   deleted: (on b10 b363) (clear b10) (arm-empty)
   added: (holding b10) (clear b363)
   goals met: 3 of 15
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 4 of 15
3. (unstack b147 b4)
   deleted: (on b147 b4) (clear b147) (arm-empty)
   added: (holding b147) (clear b4)
   goals met: 4 of 15
4. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 4 of 15
5. (unstack b186 b246)
   deleted: (on b186 b246) (clear b186) (arm-empty)
   added: (holding b186) (clear b246)
   goals met: 4 of 15
6. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 4 of 15
7. (unstack b204 b8)
   deleted: (on b204 b8) (clear b204) (arm-empty)
   added: (holding b204) (clear b8)
   goals met: 4 of 15
8. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 4 of 15
9. (unstack b246 b195)
   deleted: (on b246 b195) (clear b246) (arm-empty)
   added: (holding b246) (clear b195)
   goals met: 4 of 15
10. (putdown b246)
   deleted: (holding b246)
   added: (clear b246) (arm-empty) (on-table b246)
   goals met: 4 of 15
11. (unstack b195 b6)
   deleted: (on b195 b6) (clear b195) (arm-empty)
   added: (holding b195) (clear b6)
   goals met: 4 of 15
12. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 4 of 15
13. (unstack b266 b79)
   deleted: (on b266 b79) (clear b266) (arm-empty)
   added: (holding b266) (clear b79)
   goals met: 4 of 15
14. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 4 of 15
15. (unstack b41 b221)
   deleted: (on b41 b221) (clear b41) (arm-empty)
   added: (holding b41) (clear b221)
   goals met: 4 of 15
16. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 4 of 15
17. (unstack b221 b129)
   deleted: (on b221 b129) (clear b221) (arm-empty)
   added: (holding b221) (clear b129)
   goals met: 4 of 15
18. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 4 of 15
19. (unstack b129 b84)
   deleted: (on b129 b84) (clear b129) (arm-empty)
   added: (holding b129) (clear b84)
   goals met: 4 of 15
20. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 4 of 15
21. (unstack b79 b9)
   deleted: (on b79 b9) (clear b79) (arm-empty)
   added: (holding b79) (clear b9)
   goals met: 5 of 15
22. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 5 of 15
23. (unstack b84 b11)
   deleted: (on b84 b11) (clear b84) (arm-empty)
   added: (holding b84) (clear b11)
   goals met: 6 of 15
24. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 6 of 15
25. (unstack b11 b200)
   deleted: (on b11 b200) (clear b11) (arm-empty)
   added: (holding b11) (clear b200)
   goals met: 5 of 15
26. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 7 of 15
27. (unstack b9 b81)
   deleted: (on b9 b81) (clear b9) (arm-empty)
   added: (holding b9) (clear b81)
   goals met: 6 of 15
28. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 8 of 15
29. (unstack b81 b2)
   deleted: (on b81 b2) (clear b81) (arm-empty)
   added: (holding b81) (clear b2)
   goals met: 9 of 15
30. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 9 of 15
31. (unstack b1 b85)
   deleted: (on b1 b85) (clear b1) (arm-empty)
   added: (holding b1) (clear b85)
   goals met: 9 of 15
32. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 10 of 15
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 10 of 15
34. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 11 of 15
35. (unstack b8 b37)
   deleted: (on b8 b37) (clear b8) (arm-empty)
   added: (holding b8) (clear b37)
   goals met: 11 of 15
36. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 12 of 15
37. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 11 of 15
38. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 13 of 15
39. (unstack b7 b301)
   deleted: (on b7 b301) (clear b7) (arm-empty)
   added: (holding b7) (clear b301)
   goals met: 12 of 15
40. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 14 of 15
41. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 12 of 15
42. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 13 of 15
43. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 13 of 15
44. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 14 of 15
45. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 13 of 15
46. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 15 of 15
